Repository: oandregal/poss-gl
Catalog: tmx/ch03.tmx
Source language: en
Languages: gl

source: In digest mode, the subscriber receives one email per day, containing all the list activity for that day. For people who are following a list loosely, without participating, digest mode is often preferable, because it allows them to scan all the subjects at once and avoid the distraction of emails coming in at random times.
gl: En modo digest, o subscritor recibe só.unha mensaxe por día coa totalidade da actividade da lista nese día. Para xente que está a seguir unha lista de xeito desligado, sen participar realmente na súa actividade, o modo digest acostuma ser o máis axeitado, xa que lle permite explorar a totalidade das materias tratadas dunha vez e evitar a distracción que supón que as mensaxes estean entrando de maneira aleatoria.

source: Moderation features
gl: Utilidades de moderación

source: To "moderate" is to check posts to make sure they are a)&nbsp;not&nbsp;spam, and b)&nbsp;on&nbsp;topic, before they go out to the entire list. Moderation necessarily involves humans, but software can do a lot to make it easier. There is more said about moderation later.
gl: "Moderar" consiste en controlar que as mensaxes entrantes:a)&nbsp;non son&nópico da bsp;spam, e b)&nbsp;se corresponden có&nbsp;tópico da lista, antes da súa distribución aos restantes usuarios da mesma. O feito de moderar as listas é unha tarefa tipicamente humana, mais o software pode contribuír enormemente a facela máis sinxela. Falaremos máis sobre a moderación máis adiante.

source: Administrative interface
gl: Interface administrativa

source: Among other things, this enables an administrator to go in and remove obsolete addresses easily. This can become urgent when a recipient's address starts sending automatic "I am no longer at this address" replies back to the list in response to every list post. (Some mailing list software can even detect this by itself and unsubscribe the person automatically.)
gl: Entre outras cousas, permite ao administrador dar de baixa enderezos obsoletos de maneira sinxela. Isto pode ser urxente se o enderezo dun usuario comeza a emitir mensaxes automáticas do tipo "Non estou xa neste enderezo" en resposta a cada mensaxe enviada á lista. Algúns softwares de listas de correos poden mesmo detectar estas situacións por si mesmos e dar de baixa automaticamente á persoa en cuestión.

source: Header manipulation
gl: Manipulación de cabezallos

source: Many people have sophisticated filtering and replying rules set up in their mail readers. Mailing list software can add and manipulate certain standard headers for these people to take advantage of (more details below).
gl: Moita xente ten activadas no seu software de correo electrónico regras de filtraxe e de resposta realmente sofisticadas. O software de xestión de listas de correo pode engadir e manipular os cabezallos estándar para que esta xente se beneficie delas (algúns detalles máis adiante).

source: <term>Archiving</term>
gl: <term>Arquivamento</term>

source: All posts to the managed lists are stored and made available on the web; alternatively, some mailing list software offers special interfaces for plugging in an external archiving tool such as MHonArc (<ulink url="http://www.mhonarc.org/"></ulink>). As <xref linkend="using-archives"/><phrase output="printed"> in <xref linkend="communications"/></phrase> discusses, archiving is crucial.
gl: Todas as mensaxes enviadas ás listas xestionadas son almacenadas e postas á disposición dos interesados na web; alternativamente, algúns softwares de listas de correo ofrecen interfaces especiais para enlazar ferramentas externas de arquivamento tales como MHonArc (<ulink url="http://www.mhonarc.org/"></ulink>). Como se comenta en <xref linkend="usando os arquivos"/><phrase output="printed"> en <xref linkend="comunicacións"/></phrase> , o arquivamento é unha tarefa crucial.

source: The point of all this is merely to emphasize that mailing list management is a complex problem that has been given a lot of thought, and mostly been solved. You certainly don't need to become an expert in it. But you should be aware that there's always room to learn more, and that list management will occupy your attention from time to time in the course of running a free software project. Below we'll examine a few of the most common mailing list configuration issues.
gl: A intención de todos estes comentarios é salientar que a xestión das listas de correo é un problema complexo sobre o que se ten pensado moito, e que foi en grande medida solucionado. Certamente, vós non precisades tornarvos en expertos na materia. Mais deberiades saber que sempre hai máis sobre o que aprender, e que a xestión das listas vai ocupar a vosa atención de cando en vez ao longo da vida dun proxecto de software libre. Máis adiante examinaremos unhas poucas das cuestións máis frecuentes relativas á configuración das listas de correo.

source: Spam Prevention
gl: Prevención do spam

source: Between when this sentence is written and when it is published, the Internet-wide spam problem will probably double in severity&mdash;or at least it will feel that way. There was a time, not so long ago, when one could run a mailing list without taking any spam-prevention measures at all. The occasional stray post would still show up, but infrequently enough to be only a low-level annoyance. That era is gone forever. Today, a mailing list that takes no spam prevention measures will quickly be submerged in junk emails, to the point of unusability. Spam prevention is mandatory.
gl: Entre o momento en que esta frase foi escrita e aquel en que foi publicada, seguramente o problema do spam ten duplicado a súa severidade&mdash;ou cando menos se percibirá dese xeito. Houbo un tempo, non hai tanto, cando un podía pór en marcha unha lista de correo sen ter que tomar ningunha medida anti-spam. A mensaxe perniciosa ocasional podía certamente aparecer, mais de xeito tan pouco frecuente que se consideraba un inconveniente de baixo nivel. Ese tempo foise para sempre. Hoxe en día, unha lista de correo que non adopte ningunha precaución anti-spam verase rapidamente asolagada por correos lixo, ata o punto de se tornar inutilizable. A prevención anti-spam é polo tanto obrigatoria.

source: We divide spam prevention into two categories: preventing spam posts from appearing on your mailing lists, and preventing your mailing list from being a source of new email addresses for spammers' harvesters. The former is more important, so we examine it first.
gl: A prevención anti-spam pode ser dividida en dúas categorías: a que prevén que entren mensaxes spam na túa lista, e aquela que trata de evitar que a lista se converta nunha fonte de enderezos de correo electrónico para os spammers que as colleitan. A primeira é a máis importante, así que a analizaremos en primeiro lugar.

source: Filtering posts
gl: Filtraxe das mensaxes

source: There are three basic techniques for preventing spam posts, and most mailing list software offers all three. They are best used in tandem:
gl: Hai tres técnicas básicas para evitar a entrada de mensaxes lixo, e os máis dos software de listas fornecen as tres. Traballan mellor cando se usan en tándem:

source: Only auto-allow postings from list subscribers.
gl: Soamente permitir automaticamente aquelas mensaxes enviadas á lista por subscritores.

source: This is effective as far as it goes, and also involves very little administrative overhead, since it's usually just a matter of changing a setting in the mailing list software's configuration. But note that posts which aren't automatically approved must not be simply discarded. Instead, they should be passed along for moderation, for two reasons. First, you want to allow non-subscribers to post. A person with a question or suggestion should not need to subscribe to a mailing list just to make a single post there. Second, even subscribers may sometimes post from an address other than the one by which they're subscribed. Email addresses are not a reliable method of identifying people, and shouldn't be treated as such.
gl: Esta é unha medida efectiva cando está activa, e implica moi pouco traballo administrativo, xa que normalmente obriga a mudar tan só unha opción na configuración do software de xestión da lista. Mais tede en conta que as mensaxes que non son automaticamente aprobadas non deben ser simplemente descartadas. Pola contra, deben pasar a ser moderadas por dúas razóns. A primeira é que ides querer que os non subscritores poidan contribuír. Unha persoa que quere facer un comentario ou unha suxestión non debería ter que subscribirse tan só para enviar unha única mensaxe. En segundo lugar, mesmo os subscritores poden, en ocasións, enviar mensaxes desde enderezos distintos a aqueles cos que se cadastraron na lista. Os enderezos de correo electrónico no son un método fiable de identificación das persoas, e non deberían ser tratados como tales.

source: Filter posts through spam-filtering software.
gl: Filtraxe de mensaxes a través de software de control de spam.

source: If the mailing list software makes it possible (most do), you can have posts filtered by spam-filtering software. Automatic spam-filtering is not perfect, and never will be, since there is a never-ending arms race between spammers and filter writers. However, it can greatly reduce the amount of spam that gets through to the moderation queue, and since the longer that queue is the more time humans must spend examining it, any amount of automated filtering is beneficial.
gl: Se o software da lista de correo o permitir (os máis deles o fan), podedes facer que as mensaxes sexan controladas por unha aplicación de filtraxe de spam. A filtraxe automática de spam non é perfecta, e nunca o vai ser, xa que hai unha carreira inacabable entre os spammers e os escritores de filtros. Porén, pode reducir sensiblemente a cantidade de spam que atravesa a ringleira de moderación, e dado que canto máis longa é a ringleira máis tempo de dedicación require dos humanos, calquera cantidade de filtraxe automática resulta beneficiosa.

source: There is not space here for detailed instructions on setting up spam filters. You will have to consult your mailing list software's documentation for that (see <xref linkend="mailing-list-software"/><phrase output="printed"> later in this chapter</phrase>). List software often comes with some built-in spam prevention features, but you may want to add some third-party filters. I've had good experiences with these two: SpamAssassin (<ulink url="http://spamassassin.apache.org/"></ulink>) and SpamProbe (<ulink url="http://spamprobe.sourceforge.net/"></ulink>). This is not a comment on the many other open source spam filters out there, some of which are apparently also quite good. I just happen to have used those two myself and been satisfied with them.
gl: Non temos espazo dabondo neste libro para transmitirvos instrucións detalladas sobre como configurar os filtros anti-spam. Teredes que consultar as instrucións do software da vosa lista (ver <xref linkend="software de listas de correo"/><phrase output="printed"> máis adiante neste capítulo</phrase>). O software de listas de correo inclúe frecuentemente algunha utilidade preconfigurada de prevención anti-spam, mais pode que vós queirades engadir algúns filtros de terceiros. Persoalmente teño boas experiencias con estes dous: SpamAssassin (<ulink url="http://spamassassin.apache.org/"></ulink>) e SpamProbe (<ulink url="http://spamprobe.sourceforge.net/"></ulink>). Isto non supón ningunha valoración de outros filtros anti-spam libres, algúns dos cales son aparentemente bastante bos. É só que eu usei os dous mencionados e quedei moi satisfeito con eles.

source: Moderation.
gl: Moderación.

source: For mails that aren't automatically allowed by virtue of being from a list subscriber, and which make it through the spam filtering software, if any, the last stage is <firstterm>moderation</firstterm>: the mail is routed to a special address, where a human examines it and confirms or rejects it.
gl: Para aquelas mensaxes que non foren automaticamente autorizadas por procederen dun subscritor da lista, e que pasaren a través do software de filtraxe de spam, se for o caso, o último paso é o da <firstterm>moderación</firstterm>: a mensaxe é enviada a un enderezo especial, no que un individuo a examina e decide se é aprobada ou rexeitada.

source: Confirming a post takes one of two forms: you can accept the post just this once, or you can tell the list software to allow this and all future posts from the same sender. You almost always want to do the latter, in order to reduce the future moderation burden. Details on how to confirm vary from system to system, but it's usually a matter of replying to a special address with the command "accept" (meaning accept just this one post) or "allow" (allow this and future posts).
gl: A aprobación dunha mensaxe pode facerse de dúas maneiras: pódese aceptar a mensaxe só por esta vez, ou podes dicirlle á lista que acepte esta e calquera outra mensaxe que no futuro proceda do mesmo remitente. As máis das veces é isto último o que se fai, xa que así se reduce a carga de traballo da moderación. Os detalles sobre como se fai varían de sistema a sistema, mais xeralmente consiste en responder a un determinado enderezo de correo coa mensaxe "aceptar" (o que quere dicir que se acepta tan só esta mensaxe) ou "permitir" (aprobando esta e outras mensaxes futuras).

source: Rejecting is usually done by simply ignoring the moderation mail. If the list software never receives confirmation that something is a valid post, then it won't pass that post on to the list, so simply dropping the moderation mail achieves the desired effect. Sometimes you also have the option of responding with a "reject" or "deny" command, to automatically disapprove future mails from the same sender without even running them through moderation. There is rarely any point doing this, since moderation is mostly about spam prevention, and spammers tend not to send from the same address twice anyway.
gl: O rexeitamento faise xeralmente ignorando a mensaxe de moderación. Se o software da lista non dá recibido a confirmación de que algo é unha mensaxe válida, non a pasará á lista, así que o efecto desexado se produce se simplemente non se dá curso á mensaxe de moderación. Ás veces tamén tés a opción de responderes cos comandos "rexeitar" ou "denegar", para que ningunha mensaxe do mesmo remitente sexa aceptada no futuro, sen necesidade de sometelas a moderación. Xeralmente non ten moito sentido facer isto, xa que a moderación tenta controlar o spam, e os spammers moi raramente empregan dúas veces o mesmo enderezo.

source: Be sure to use moderation <emphasis>only</emphasis> for filtering out spams and clearly off-topic messages, such as when someone accidentally posts to the wrong mailing list. The moderation system will usually give you a way to respond directly to the sender, but don't use that method to answer questions that really belong on the mailing list itself, even if you know the answer off the top of your head. To do so would deprive the project's community of an accurate picture of what sorts of questions people are asking, and deprive them of a chance to answer questions themselves and/or see answers from others. Mailing list moderation is strictly about keeping the list free of junk and off-topic emails, nothing more.
gl: Tede coidado de empregardes a moderación <emphasis>tan só</emphasis> para filtrardes o spam e as mensaxes claramente fóra de tópico, como cando alguén manda accidentalmente un correo á lista equivocada. O sistema de moderación adoita permitir a resposta directa ao remitente, mais non se debe usar este método para dar resposta a preguntas que en realidade entran no ámbito de actividade da propia lista, aínda que teñades absolutamente clara a resposta. Facer iso privaría á comunidade do coñecemento exacto acerca de que clase de preguntas fai a xente, e impediríalles responder por eles mesmos ou ver as respostas que outros poidan enviar. A moderación das listas de correo ten a ver exclusivamente con mantelas libres de correo lixo e mensaxes fóra de tópico, nada máis.

source: Address hiding in archives
gl: Ocultación de enderezos nos arquivos

source: To prevent your mailing lists from being a source of addresses for spammers, a common technique is for the archives to obscure people's email addresses, for example by replacing
gl: Para evitares que as túas listas de correo se convertan nunha fonte de subministro de enderezos para os spammers, unha técnica habitual é a de que os arquivos oculten os enderezos da xente, por exemplo substituíndo

source: <blockquote> <para><literal>jrandom@somedomain.com</literal></para> </blockquote> <para>with</para> <blockquote> <para><literal>jrandom_AT_somedomain.com</literal></para> </blockquote> <para>or</para> <blockquote> <para><literal>jrandomNOSPAM@somedomain.com</literal></para> </blockquote>
gl: <blockquote> <para><literal>jrandom@somedomain.com</literal></para> </blockquote> <para>por</para> <blockquote> <para><literal>jrandom_AT_somedomain.com</literal></para> </blockquote> <para>ou</para> <blockquote> <para><literal>jrandomNOSPAM@somedomain.com</literal></para> </blockquote>

source: or some similarly obvious (to a human) encoding. Since spam address harvesters often work by crawling through web pages&mdash;including your mailing list's online archives&mdash;and looking for sequences containing "@", encoding the addresses is a way of making people's email addresses invisible or useless to spammers. This does nothing to prevent spam from being sent to the mailing list itself, of course, but it does avoid increasing the amount of spam sent directly to list users' personal addresses.
gl: ou algunha maneira igualmente obvia (para os humanos) de codificalas. Dado que os colleitadores de enderezos para spam funcionan frecuentemente uliscando nas páxinas web&mdash;incluíndo os arquivos web da túa lista de correo&mdash;e buscando secuencias que conteñan "@", codificar os enderezos é a maneira de tornalos inútiles ou invisibles para os spammers. Por suposto que isto non evita que o spam sexa enviado directamente á propia lista, mais si que minimiza a cantidade de lixo que chega aos enderezos persoais dos membros da lista.

source: Address hiding can be controversial. Some people like it a lot, and will be surprised if your archives don't do it automatically. Other people think it's too much of an inconvenience (because humans also have to translate the addresses back before using them). Sometimes people assert that it's ineffective, because a harvester could in theory compensate for any consistent encoding pattern. However, note that there is empirical evidence that address hiding <emphasis>is</emphasis> effective, see <ulink url="http://www.cdt.org/speech/spam/030319spamreport.shtml"></ulink>.
gl: A ocultación de enderezos pode ser discutida. Gústalle moito a algunha xente , que se sorprenderá se os teus arquivos non o fan de maneira automática. Outra xente, pola contra, pensará que é unha incomodidade (xa ques as persoas terán tamén que traducir os enderezos antes de poder usalos). e hai xente que afirma que é unha práctica inútil, xa que un colleitador podería, en teoría, compensar calquera padrón de codificación. En calquera caso, hai evidencia empírica dabondo de que a ocultación de enderezos <emphasis>é</emphasis> efectiva, consulta <ulink url="http://www.cdt.org/speech/spam/030319spamreport.shtml"></ulink>.

source: Ideally, the list management software would leave the choice up to each individual subscriber, either through a special yes/no header or a setting in that subscriber's list account preferences. However, I don't know of any software which offers per-subscriber or per-post choice in the matter, so for now the list manager must make a decision for everyone (assuming the archiver offers the feature at all, which is not always the case). I lean very mildly toward turning address hiding on. Some people are very careful to avoid posting their email addresses on web pages or anywhere else a spam harvester might see it, and they would be disappointed to have all that care thrown away by a mailing list archive; meanwhile, the inconvenience address hiding imposes on archive users is very slight, since it's trivial to transform an obscured address back to a valid one if you need to reach the person. But keep in mind that, in the end, it's still an arms race: by the time you read this, harvesters might well have evolved to the point where they can recognize most common forms of hiding, and we'll have to think of something else.
gl: Idealmente, o software de xestión da lista debería deixar a escolla en mans de cada subscritor, ben mediante un cabezallo especial tipo "Si/Non" ou cunha opción de configuración nas preferencias da conta da lista de ese subscritor en particular. Porén, non coñezo ningún software que ofreza esa opción para cada subscritor ou para cada mensaxe, así que polo de agora será o xestor da lista quen teña que tomar a decisión por todos (dando por sentado que o arquivo ofrece esa utilidade, o que non sempre é así) Eu inclínome lixeiramente cara a que a ocultación de enderezos estea activada. Algunhas persoas poñen moito coidado en non publicar os seus enderezos en páxinas web ou en calquera outro sitio onde un colleitador de spam poida localizalos, e sentiríanse moi incómodos se esa precaución fose tirada ao lixo por un arquivo de listas de correo; mentres tanto, o inconveniente que supón a ocultación de enderezos para as persoas é moi pouco importante, xa que a transformación de un enderezo oculto nun utilizable é trivial no caso de que precisares acceder á persoa en cuestión. Pero non esquezas que, ao final, non deixa de ser unha carreira armamentística: para cando leas isto, os colleitadores poden perfectamente ter evolucionado ata o punto de seren quen de recoñecer as formas máis habituais de ocultación, e teremos que empezar a pensar noutra solución.

source: Identification and Header Management
gl: Identificación e xestión de cabezallos

source: List subscribers often want to put mails from the list into a project-specific folder, separate from their other mail. Their mail reading software can do this automatically by examining the mail's <firstterm>headers</firstterm>. The headers are the fields at the top of the mail that indicate the sender, recipient, subject, date, and various other things about the message. Certain headers are well known and effectively mandatory:
gl: Frecuentemente, os subscritores das listas quererán arquivar as mensaxes nunha pasta específica para o proxecto, distinta das de outras mensaxes de correo. O seu software de lectura de correo pode facer isto automaticamente sen máis que examinar os <firstterm>cabezallos</firstterm> das mensaxes. Os cabezallos son os campos situados no inicio das mensaxes que indican quen é o remitente, o destinatario, cal é o asunto, a data e outra información variada acerca da mensaxe. Algúns cabezallos son ben coñecidos e certamente imprescindibles:

source: From: ... To: ... Subject: ... Date: ...
gl: De: ... Para: ... Asunto: ... Data: ...

source: Others are optional, though still quite standard. For example, emails are not strictly required to have the
gl: Outras son opcionais, aínda que bastante habituais. Por exemplo, os emails non teñen por que levar o cabezallo

source: Reply-to: sender@email.address.here
gl: Responder a: remitente@enderezo de correo,
